In [2]:
import great_expectations as ge
import pandas as pd

In [3]:
# pip install great_expectations

In [5]:
df = pd.read_csv("addresses.csv")
df.head()

,first_name,second_name,street,city,code,pincode,dob
0,sam,sriw,120 jefferson st.,Riverside,NJ,8075,22-10-1966
1,Jack,McGinnis,220 hobo Av.,Phila,PA,9119,23-06-1986
2,juck,Repici,NaN,Riverside,NJ,8075,14-10-1968
3,Stephen,Tyler,7452 Terrace,NY,SD,91234,25-11-2002
4,rock,NaN,120 Jefferson St.,NY,NaN,298,26-01-1992

In [6]:
df = ge.from_pandas(df)

In [7]:
df.head()

,first_name,second_name,street,city,code,pincode,dob
0,sam,sriw,120 jefferson st.,Riverside,NJ,8075,22-10-1966
1,Jack,McGinnis,220 hobo Av.,Phila,PA,9119,23-06-1986
2,juck,Repici,NaN,Riverside,NJ,8075,14-10-1968
3,Stephen,Tyler,7452 Terrace,NY,SD,91234,25-11-2002
4,rock,NaN,120 Jefferson St.,NY,NaN,298,26-01-1992

In [9]:
df_1  =ge.read_csv("addresses.csv")
df_1.head()

,first_name,second_name,street,city,code,pincode,dob
0,sam,sriw,120 jefferson st.,Riverside,NJ,8075,22-10-1966
1,Jack,McGinnis,220 hobo Av.,Phila,PA,9119,23-06-1986
2,juck,Repici,NaN,Riverside,NJ,8075,14-10-1968
3,Stephen,Tyler,7452 Terrace,NY,SD,91234,25-11-2002
4,rock,NaN,120 Jefferson St.,NY,NaN,298,26-01-1992

In [10]:
df.expect_column_values_to_be_unique(column=["first_name"])

{
  "success": false,
  "result": {
    "element_count": 9,
    "missing_count": 0,
    "missing_percent": 0.0,
    "unexpected_count": 1,
    "unexpected_percent": 11.11111111111111,
    "unexpected_percent_total": 11.11111111111111,
    "unexpected_percent_nonmissing": 11.11111111111111,
    "partial_unexpected_list": [
      "first_name"
    ]
  },
  "exception_info": {
    "raised_exception": false,
    "exception_traceback": null,
    "exception_message": null
  },
  "meta": {}
}

In [11]:
df.first_name

0        sam
1       Jack
2       juck
3    Stephen
4       rock
5       Anne
6        sam
7        sam
8       juck
Name: first_name, dtype: object

In [12]:
df.expect_column_values_to_not_be_null(column=["first_name"])

{
  "success": true,
  "result": {
    "element_count": 9,
    "unexpected_count": 1,
    "unexpected_percent": 11.11111111111111,
    "unexpected_percent_total": 11.11111111111111,
    "partial_unexpected_list": []
  },
  "exception_info": {
    "raised_exception": false,
    "exception_traceback": null,
    "exception_message": null
  },
  "meta": {}
}

In [17]:
df.expect_column_values_to_be_in_set(column=["first_name"],value_set=["sam","juck","Stephen","Anne","rock","Jack"])

{
  "success": true,
  "result": {
    "element_count": 9,
    "missing_count": 0,
    "missing_percent": 0.0,
    "unexpected_count": 1,
    "unexpected_percent": 11.11111111111111,
    "unexpected_percent_total": 11.11111111111111,
    "unexpected_percent_nonmissing": 11.11111111111111,
    "partial_unexpected_list": [
      "first_name"
    ]
  },
  "exception_info": {
    "raised_exception": false,
    "exception_traceback": null,
    "exception_message": null
  },
  "meta": {}
}

In [19]:
df.expect_column_values_to_match_regex_list(column="dob",regex_list=["%d{2}-%d{2}-%d{4}"],mostly=1)

{
  "success": false,
  "result": {
    "element_count": 9,
    "missing_count": 0,
    "missing_percent": 0.0,
    "unexpected_count": 9,
    "unexpected_percent": 100.0,
    "unexpected_percent_total": 100.0,
    "unexpected_percent_nonmissing": 100.0,
    "partial_unexpected_list": [
      "22-10-1966",
      "23-06-1986",
      "14-10-1968",
      "25-11-2002",
      "26-01-1992",
      "21-10-1966",
      "22-10-1966",
      "29-12-1983",
      "14-10-1978"
    ]
  },
  "exception_info": {
    "raised_exception": false,
    "exception_traceback": null,
    "exception_message": null
  },
  "meta": {}
}

In [20]:
df.expect_column_values_to_be_of_type("first_name","str")

{
  "success": true,
  "result": {
    "element_count": 9,
    "missing_count": 0,
    "missing_percent": 0.0,
    "unexpected_count": 0,
    "unexpected_percent": 0.0,
    "unexpected_percent_total": 0.0,
    "unexpected_percent_nonmissing": 0.0,
    "partial_unexpected_list": []
  },
  "exception_info": {
    "raised_exception": false,
    "exception_traceback": null,
    "exception_message": null
  },
  "meta": {}
}

In [24]:
df.expect_table_columns_to_match_set(column_set=df.columns)

{
  "success": true,
  "result": {
    "observed_value": [
      "first_name",
      "second_name",
      "street",
      "city",
      "code",
      "pincode",
      "dob"
    ]
  },
  "exception_info": {
    "raised_exception": false,
    "exception_traceback": null,
    "exception_message": null
  },
  "meta": {}
}

In [27]:
df.expect_column_value_lengths_to_equal(column="code",value=2)

{
  "success": true,
  "result": {
    "element_count": 9,
    "missing_count": 1,
    "missing_percent": 11.11111111111111,
    "unexpected_count": 0,
    "unexpected_percent": 0.0,
    "unexpected_percent_total": 0.0,
    "unexpected_percent_nonmissing": 0.0,
    "partial_unexpected_list": []
  },
  "exception_info": {
    "raised_exception": false,
    "exception_traceback": null,
    "exception_message": null
  },
  "meta": {}
}

In [34]:
df.expect_column_values_to_match_strftime_format("dob",strftime_format="%d-%m-%Y")

{
  "success": true,
  "result": {
    "element_count": 9,
    "missing_count": 0,
    "missing_percent": 0.0,
    "unexpected_count": 0,
    "unexpected_percent": 0.0,
    "unexpected_percent_total": 0.0,
    "unexpected_percent_nonmissing": 0.0,
    "partial_unexpected_list": []
  },
  "exception_info": {
    "raised_exception": false,
    "exception_traceback": null,
    "exception_message": null
  },
  "meta": {}
}

In [31]:
df["current_date"]= "20221008"

In [33]:
df.expect_column_values_to_match_strftime_format("current_date",strftime_format="%Y%m%d")

{
  "success": true,
  "result": {
    "element_count": 9,
    "missing_count": 0,
    "missing_percent": 0.0,
    "unexpected_count": 0,
    "unexpected_percent": 0.0,
    "unexpected_percent_total": 0.0,
    "unexpected_percent_nonmissing": 0.0,
    "partial_unexpected_list": []
  },
  "exception_info": {
    "raised_exception": false,
    "exception_traceback": null,
    "exception_message": null
  },
  "meta": {}
}

In [35]:
df.expect_table_column_count_to_equal(8)

{
  "success": true,
  "result": {
    "observed_value": 8
  },
  "exception_info": {
    "raised_exception": false,
    "exception_traceback": null,
    "exception_message": null
  },
  "meta": {}
}

In [37]:
output = df.expect_column_to_exist("dob")
print(output["success"])

True

In [ ]:
df.expect